In [19]:
import sqlite3 as sl
import pandas as pd
import numpy as np

In [33]:
# Connect with DB

con_db = sl.connect('my_test.db')

In [34]:
# Create table 

with con_db:
    con_db.execute("""
        CREATE TABLE USER (
            id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
            name TEXT,
            age INTEGER
        );
    """)

OperationalError: table USER already exists

In [35]:
# Insert Records

sql = 'INSERT INTO USER (id, name, age) values(?, ?, ?)'
data = [
    (1, 'Alice', 21),
    (2, 'Bob', 22),
    (3, 'Chris', 23)
]

In [36]:
# with con_db:
#     con_db.executemany(sql, data)

In [37]:
with con_db:
    data = con_db.execute("SELECT * FROM USER WHERE age <= 22")
    for row in data:
        print(row)

(1, 'Alice', 21)
(2, 'Bob', 22)

In [38]:
# Define a dataframe in pandas

df_skill = pd.DataFrame({
    'user_id': [1,1,2,2,3,3,3],
    'skill': ['Network Security', 'Algorithm Development', 'Network Security', 'Java', 'Python', 'Data Science', 'Machine Learning']
})

df_skill

   user_id                  skill
0        1       Network Security
1        1  Algorithm Development
2        2       Network Security
3        2                   Java
4        3                 Python
5        3           Data Science
6        3       Machine Learning

In [39]:
#Save dataframe in database my_text.db

df_skill.to_sql('SKILL', con_db)

ValueError: Table 'SKILL' already exists.

In [40]:
# Join tables created in Pandas and SQLite query

df = pd.read_sql('''
    SELECT s.user_id, u.name, u.age, s.skill 
    FROM USER u LEFT JOIN SKILL s ON u.id = s.user_id
''', con_db)

In [41]:
# Show db
df

   user_id   name  age                  skill
0        1  Alice   21  Algorithm Development
1        1  Alice   21       Network Security
2        2    Bob   22                   Java
3        2    Bob   22       Network Security
4        3  Chris   23           Data Science
5        3  Chris   23       Machine Learning
6        3  Chris   23                 Python

In [42]:
# Agree prev table to db my_text.db

df.to_sql('USER_SKILL', con_db)

ValueError: Table 'USER_SKILL' already exists.

## Show tables created

In [47]:
df

   user_id   name  age                  skill
0        1  Alice   21  Algorithm Development
1        1  Alice   21       Network Security
2        2    Bob   22                   Java
3        2    Bob   22       Network Security
4        3  Chris   23           Data Science
5        3  Chris   23       Machine Learning
6        3  Chris   23                 Python

In [48]:
df_skill

   user_id                  skill
0        1       Network Security
1        1  Algorithm Development
2        2       Network Security
3        2                   Java
4        3                 Python
5        3           Data Science
6        3       Machine Learning

In [51]:
user = con_db.execute("SELECT * FROM USER")
user